app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show        # show existing student
    @student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-10-30 00:56:55.673907"], ["updated_at", "2018-10-30 00:56:55.673907"]]
---
  def create
    @student = Student.new(params.require(:student).permit(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit        # update existing student (2 methods)
    @student = Student.find(params[:id])